In [1]:
import pandas as pd 
import numpy as np

In [2]:
dict1={"name":["ankit","manish",None,"aymen"],
      "age":[32,30,26,np.nan],
      "city":["Hdr",None,"Channei","Blr"]}
df=pd.DataFrame(dict1)
df

     name   age     city
0   ankit  32.0      Hdr
1  manish  30.0     None
2    None  26.0  Channei
3   aymen   NaN      Blr

In [3]:
df.dtypes

name     object
age     float64
city     object
dtype: object

In [4]:
dict1={"name":["mrityunjay","manish",None,"nitish"],
      "age":[32,30,"26",np.nan],
      "city":["Hdr",None,"Channei","Blr"]}
df1=pd.DataFrame(dict1)
df1

         name  age     city
0  mrityunjay   32      Hdr
1      manish   30     None
2        None   26  Channei
3      nitish  NaN      Blr

In [5]:
df1.dtypes

name    object
age     object
city    object
dtype: object

In [6]:
dict1={"name":["singh","manish",None,"aymen"],
      "age":[32,30,"26",26],
      "city":["Hdr",None,"Channei","Blr"]}
df2=pd.DataFrame(dict1)
df2

     name age     city
0   singh  32      Hdr
1  manish  30     None
2    None  26  Channei
3   aymen  26      Blr

In [7]:
df2["age"]=df2["age"].astype("int")
df2.dtypes

name    object
age      int32
city    object
dtype: object

In [8]:
# handal missing value
dict1={"name":["ashish","rakesh",None,"manish"],
      "age":[32,30,"26",np.nan],
      "city":["Hdr",None,"Channei","Blr"]}
df1=pd.DataFrame(dict1)
df1.isnull().sum()

name    1
age     1
city    1
dtype: int64

In [9]:
df1.isna().sum()

name    1
age     1
city    1
dtype: int64

In [10]:
df1.isna().sum()/len(df1)

name    0.25
age     0.25
city    0.25
dtype: float64

In [11]:
df1.isna().sum()*100/len(df1)

name    25.0
age     25.0
city    25.0
dtype: float64

In [12]:
#fill the value
df.fillna(20)

     name   age     city
0   ankit  32.0      Hdr
1  manish  30.0       20
2      20  26.0  Channei
3   aymen  20.0      Blr

In [13]:
df.fillna("Channei")

      name      age     city
0    ankit     32.0      Hdr
1   manish     30.0  Channei
2  Channei     26.0  Channei
3    aymen  Channei      Blr

In [14]:
df["city"]=df["city"].fillna("panjab")
df

     name   age     city
0   ankit  32.0      Hdr
1  manish  30.0   panjab
2    None  26.0  Channei
3   aymen   NaN      Blr

In [15]:
dict1={"name":["manish",None,"asish","aymen"],
      "age":[32,30,26,np.nan],
      "city":["Hdr",None,"Channei","Blr"]}
df=pd.DataFrame(dict1)
df

     name   age     city
0  manish  32.0      Hdr
1    None  30.0     None
2   asish  26.0  Channei
3   aymen   NaN      Blr

In [16]:
# bfill, ffill, backfill, pad
df.fillna(method="bfill")

C:\Users\Mrityunjay\AppData\Local\Temp\ipykernel_10520\1595065152.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="bfill")

     name   age     city
0  manish  32.0      Hdr
1   asish  30.0  Channei
2   asish  26.0  Channei
3   aymen   NaN      Blr

In [17]:
df.fillna(method="backfill")

C:\Users\Mrityunjay\AppData\Local\Temp\ipykernel_10520\28332659.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="backfill")

     name   age     city
0  manish  32.0      Hdr
1   asish  30.0  Channei
2   asish  26.0  Channei
3   aymen   NaN      Blr

In [18]:
df.fillna(method="ffill")

C:\Users\Mrityunjay\AppData\Local\Temp\ipykernel_10520\3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

     name   age     city
0  manish  32.0      Hdr
1  manish  30.0      Hdr
2   asish  26.0  Channei
3   aymen  26.0      Blr

In [19]:
df.fillna(method="pad")

C:\Users\Mrityunjay\AppData\Local\Temp\ipykernel_10520\4167762737.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="pad")

     name   age     city
0  manish  32.0      Hdr
1  manish  30.0      Hdr
2   asish  26.0  Channei
3   aymen  26.0      Blr

In [20]:
import warnings
warnings.filterwarnings("ignore")

In [21]:
df.fillna(method="bfill")

     name   age     city
0  manish  32.0      Hdr
1   asish  30.0  Channei
2   asish  26.0  Channei
3   aymen   NaN      Blr

In [22]:
df.fillna(method="ffill")

     name   age     city
0  manish  32.0      Hdr
1  manish  30.0      Hdr
2   asish  26.0  Channei
3   aymen  26.0      Blr

In [23]:
df.fillna(method="backfill")

     name   age     city
0  manish  32.0      Hdr
1   asish  30.0  Channei
2   asish  26.0  Channei
3   aymen   NaN      Blr

In [24]:
df.fillna(method="pad")

     name   age     city
0  manish  32.0      Hdr
1  manish  30.0      Hdr
2   asish  26.0  Channei
3   aymen  26.0      Blr

In [25]:
df.fillna(method="bfill",axis=1)

     name   age     city
0  manish  32.0      Hdr
1    30.0  30.0      NaN
2   asish  26.0  Channei
3   aymen   Blr      Blr

In [26]:
df.fillna(method="bfill",axis=0)       #by default

     name   age     city
0  manish  32.0      Hdr
1   asish  30.0  Channei
2   asish  26.0  Channei
3   aymen   NaN      Blr

In [27]:
df.fillna(method="ffill")

     name   age     city
0  manish  32.0      Hdr
1  manish  30.0      Hdr
2   asish  26.0  Channei
3   aymen  26.0      Blr

In [28]:
df

     name   age     city
0  manish  32.0      Hdr
1    None  30.0     None
2   asish  26.0  Channei
3   aymen   NaN      Blr

**KKN Imputer**

In [30]:
from sklearn.impute import KNNImputer
k=KNNImputer()
df1["age"]=k.fit_transform(round(df1[["age"]],2))
df1

     name        age     city
0  ashish  32.000000      Hdr
1  rakesh  30.000000     None
2    None  26.000000  Channei
3  manish  29.333333      Blr

In [31]:
#read the data frame
df=pd.read_csv("telecom_churn_data.csv")
df

,year,customer_id,phone_no,gender,age,no_of_days_subscribed,multi_screen,mail_subscribed,weekly_mins_watched,minimum_daily_mins,maximum_daily_mins,weekly_max_night_mins,videos_watched,maximum_days_inactive,customer_support_calls,churn
0,2015,100198,409-8743,Female,36,62,no,no,148.35,12.2,16.81,82,1,4.0,1,0.0
1,2015,100643,340-5930,Female,39,149,no,no,294.45,7.7,33.37,87,3,3.0,2,0.0
2,2015,100756,372-3750,Female,65,126,no,no,87.30,11.9,9.89,91,1,4.0,5,1.0
3,2015,101595,331-4902,Female,24,131,no,yes,321.30,9.5,36.41,102,4,3.0,3,0.0
4,2015,101653,351-8398,Female,40,191,no,no,243.00,10.9,27.54,83,7,3.0,1,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1995,2015,997132,385-7387,Female,54,75,no,yes,182.25,11.3,20.66,97,5,4.0,2,NaN
1996,2015,998086,383-9255,Male,45,127,no,no,273.45,9.3,30.99,116,3,3.0,1,0.0
1997,2015,998474,353-2080,NaN,53,94,no,no,128.85,15.6,14.60,110,16,5.0,0,0.0
1998,2015,998934,359-7788,Male,40,94,no,no,178.05,10.4,20.18,100,6,NaN,3,0.0
1999,2015,999961,414-1496,Male,37,73,no,no,326.70,10.3,37.03,89,6,3.0,1,1.0

In [32]:
#check the null columns
df.isnull().sum()

year                       0
customer_id                0
phone_no                   0
gender                    24
age                        0
no_of_days_subscribed      0
multi_screen               0
mail_subscribed            0
weekly_mins_watched        0
minimum_daily_mins         0
maximum_daily_mins         0
weekly_max_night_mins      0
videos_watched             0
maximum_days_inactive     28
customer_support_calls     0
churn                     35
dtype: int64

In [33]:
#mode
g_mode=df["gender"].mode()
g_mode

0    Male
Name: gender, dtype: object

In [34]:
#null value replace with values
df["gender"]=df["gender"].fillna(g_mode[0])

In [35]:
mean_=df["maximum_days_inactive"].mean()
mean_

3.2505070993914806

In [36]:
#null value replace with values
df["maximum_days_inactive"]=df["maximum_days_inactive"].fillna(mean_)

In [37]:
c_mode=df["churn"].mode()
c_mode

0    0.0
Name: churn, dtype: float64

In [38]:
#null value replace with values
df["churn"]=df["churn"].fillna(c_mode[0])

In [39]:
# After fill null value check it.
df.isnull().sum()

year                      0
customer_id               0
phone_no                  0
gender                    0
age                       0
no_of_days_subscribed     0
multi_screen              0
mail_subscribed           0
weekly_mins_watched       0
minimum_daily_mins        0
maximum_daily_mins        0
weekly_max_night_mins     0
videos_watched            0
maximum_days_inactive     0
customer_support_calls    0
churn                     0
dtype: int64